

/***********************crate database db_mori_hafez******************************************/
var Database_Name = 'hafez21';  
var Version = 1.0;  
var Text_Description = 'My First Web-SQL v Example';  
var Database_Size = 2 * 1024 * 1024;  

var db_mori_hafez = openDatabase(Database_Name, Version, Text_Description, Database_Size);  







/***********************crate table******************************************/
db_mori_hafez.transaction(function (tx) {  
tx.executeSql('CREATE TABLE IF NOT EXISTS book72 ( bb INTEGER PRIMARY KEY  , poem)');  
});  



/***********************insert poem to table******************************************/
db_mori_hafez.transaction(function (tx) {  
tx.executeSql('INSERT INTO book72 ( poem) VALUES ("الا یا ایها الساقی ادر کأسا و ناولها<br><br>که عشق آسان نمود اول ولی افتاد مشکل‌ها<br><br>به بوی نافه‌ای کاخر صبا زان طره بگشاید<br><br>ز تاب جعد مشکینش چه خون افتاد در دل‌ها<br><br>مرا در منزل جانان چه امن عیش چون هر دم<br><br>جرس فریاد می‌دارد که بربندید محمل‌ها<br><br>به می سجاده رنگین کن گرت پیر مغان گوید<br><br>که سالک بی‌خبر نبود ز راه و رسم منزل‌ها<br><br>شب تاریک و بیم موج و گردابی چنین هایل<br><br>کجا دانند حال ما سبکباران ساحل‌ها<br><br>همه کارم ز خود کامی به بدنامی کشید آخر<br><br>نهان کی ماند آن رازی کز او سازند محفل‌ها<br><br>حضوری گر همی‌خواهی از او غایب مشو حافظ<br><br>متی ما تلق من تهوی دع الدنیا و اهملها")'); 

 
tx.executeSql('INSERT INTO book72 ( poem) VALUES ("صلاح کار کجا و من خراب کجا<br><br>ببین تفاوت ره کز کجاست تا به کجا<br><br>دلم ز صومعه بگرفت و خرقه سالوس<br><br>کجاست دیر مغان و شراب ناب کجا<br><br>چه نسبت است به رندی صلاح و تقوا را<br><br>سماع وعظ کجا نغمه رباب کجا<br><br>ز روی دوست دل دشمنان چه دریابد<br><br>چراغ مرده کجا شمع آفتاب کجا<br><br>چو کحل بینش ما خاک آستان شماست<br><br>کجا رویم بفرما از این جناب کجا<br><br>مبین به سیب زنخدان که چاه در راه است<br><br>کجا همی‌روی ای دل بدین شتاب کجا<br><br>بشد که یاد خوشش باد روزگار وصال<br><br>خود آن کرشمه کجا رفت و آن عتاب کجا<br><br>قرار و خواب ز حافظ طمع مدار ای دوست<br><br>قرار چیست صبوری کدام و خواب کجا")'); 

tx.executeSql('INSERT INTO book72 ( poem) VALUES  ("اگر آن ترک شیرازی به دست آرد دل ما را<br><br>به خال هندویش بخشم سمرقند و بخارا را<br><br>بده ساقی می باقی که در جنت نخواهی یافت<br><br>کنار آب رکن آباد و گلگشت مصلا را<br><br>فغان کاین لولیان شوخ شیرین کار شهرآشوب<br><br>چنان بردند صبر از دل که ترکان خوان یغما را<br><br>ز عشق ناتمام ما جمال یار مستغنی است<br><br>به آب و رنگ و خال و خط چه حاجت روی زیبا را<br><br>من از آن حسن روزافزون که یوسف داشت دانستم<br><br>که عشق از پرده عصمت برون آرد زلیخا را<br><br>اگر دشنام فرمایی و گر نفرین دعا گویم<br><br>جواب تلخ می‌زیبد لب لعل شکرخا را<br><br>نصیحت گوش کن جانا که از جان دوست‌تر دارند<br><br>جوانان سعادتمند پند پیر دانا را<br><br>حدیث از مطرب و می گو و راز دهر کمتر جو<br><br>که کس نگشود و نگشاید به حکمت این معما را<br><br>غزل گفتی و در سفتی بیا و خوش بخوان حافظ<br><br>که بر نظم تو افشاند فلک عقد ثریا را")'); 
tx.executeSql('INSERT INTO book72 ( poem) VALUES ("صبا به لطف بگو آن غزال رعنا را<br><br>که سر به کوه و بیابان تو داده‌ای ما را<br><br>شکرفروش که عمرش دراز باد چرا<br><br>تفقدی نکند طوطی شکرخا را<br><br>غرور حسنت اجازت مگر نداد ای گل<br><br>که پرسشی نکنی عندلیب شیدا را<br><br>به خلق و لطف توان کرد صید اهل نظر<br><br>به بند و دام نگیرند مرغ دانا را<br><br>ندانم از چه سبب رنگ آشنایی نیست<br><br>سهی قدان سیه چشم ماه سیما را<br><br>چو با حبیب نشینی و باده پیمایی<br><br>به یاد دار محبان بادپیما را<br><br>جز این قدر نتوان گفت در جمال تو عیب<br><br>که وضع مهر و وفا نیست روی زیبا را<br><br>در آسمان نه عجب گر به گفته حافظ<br><br>سرود زهره به رقص آورد مسیحا را")');

tx.executeSql('INSERT INTO book72 ( poem) VALUES ("دل می‌رود ز دستم صاحب دلان خدا را<br><br>دردا که راز پنهان خواهد شد آشکارا<br><br>کشتی شکستگانیم ای باد شرطه برخیز<br><br>باشد که بازبینم دیدار آشنا را<br><br>ده روزه مهر گردون افسانه است و افسون<br><br>نیکی به جای یاران فرصت شمار یارا<br><br>در حلقه گل و مل خوش خواند دوش بلبل<br><br>هات الصبوح هبوا یا ایها السکارا<br><br>ای صاحب کرامت شکرانه سلامت<br><br>روزی تفقدی کن درویش بی‌نوا را<br><br>آسایش دو گیتی تفسیر این دو حرف است<br><br>با دوستان مروت با دشمنان مدارا<br><br>در کوی نیک نامی ما را گذر ندادند<br><br>گر تو نمی‌پسندی تغییر کن قضا را<br><br>آن تلخ وش که صوفی ام الخبائثش خواند<br><br>اشهی لنا و احلی من قبله العذارا<br><br>هنگام تنگدستی در عیش کوش و مستی<br><br>کاین کیمیای هستی قارون کند گدا را<br><br>سرکش مشو که چون شمع از غیرتت بسوزد<br><br>دلبر که در کف او موم است سنگ خارا<br><br>آیینه سکندر جام می است بنگر<br><br>تا بر تو عرضه دارد احوال ملک دارا<br><br>خوبان (ترکان) پارسی گو بخشندگان عمرند<br><br>ساقی بده بشارت رندان پارسا را<br><br>حافظ به خود نپوشید این خرقه می آلود<br><br>ای شیخ پاکدامن معذور دار ما را")');

//tx.executeSql('INSERT INTO book72 ( poem) VALUES ("")');
});  




function getfall(){

var uu = (Math.random() * 5) ;
db_mori_hafez.transaction(function (tx) { 

    tx.executeSql('SELECT * FROM book72', [], function (tx, results) {
              document.getElementById("fall").innerHTML =results.rows.item(uu).poem;
                                  }  
                                                                                 , null);  
                             });  
                            }

function startt() {
  var output = document.form1.moritextarea.value;
  output = output.replace(/(?:\r\n|\r|\n)/g, '<br>');
  alert(output);
  }
