

/***********************crate database db_mori_hafez******************************************/
var Database_Name = 'hafez21';  
var Version = 1.0;  
var Text_Description = 'My First Web-SQL v Example';  
var Database_Size = 2 * 1024 * 1024;  

var db_mori_hafez = openDatabase(Database_Name, Version, Text_Description, Database_Size);  







/***********************crate table******************************************/
db_mori_hafez.transaction(function (tx) {  
tx.executeSql('CREATE TABLE IF NOT EXISTS book72 ( bb INTEGER PRIMARY KEY  , poem)');  
});  



/***********************insert poem to table******************************************/
db_mori_hafez.transaction(function (tx) {  
tx.executeSql('INSERT INTO book72 ( poem) VALUES ("الا یا ایها الساقی ادر کأسا و ناولها<br><br>که عشق آسان نمود اول ولی افتاد مشکل‌ها<br><br>به بوی نافه‌ای کاخر صبا زان طره بگشاید<br><br>ز تاب جعد مشکینش چه خون افتاد در دل‌ها<br><br>مرا در منزل جانان چه امن عیش چون هر دم<br><br>جرس فریاد می‌دارد که بربندید محمل‌ها<br><br>به می سجاده رنگین کن گرت پیر مغان گوید<br><br>که سالک بی‌خبر نبود ز راه و رسم منزل‌ها<br><br>شب تاریک و بیم موج و گردابی چنین هایل<br><br>کجا دانند حال ما سبکباران ساحل‌ها<br><br>همه کارم ز خود کامی به بدنامی کشید آخر<br><br>نهان کی ماند آن رازی کز او سازند محفل‌ها<br><br>حضوری گر همی‌خواهی از او غایب مشو حافظ<br><br>متی ما تلق من تهوی دع الدنیا و اهملها")'); 

 
tx.executeSql('INSERT INTO book72 ( poem) VALUES ("صلاح کار کجا و من خراب کجا<br><br>ببین تفاوت ره کز کجاست تا به کجا<br><br>دلم ز صومعه بگرفت و خرقه سالوس<br><br>کجاست دیر مغان و شراب ناب کجا<br><br>چه نسبت است به رندی صلاح و تقوا را<br><br>سماع وعظ کجا نغمه رباب کجا<br><br>ز روی دوست دل دشمنان چه دریابد<br><br>چراغ مرده کجا شمع آفتاب کجا<br><br>چو کحل بینش ما خاک آستان شماست<br><br>کجا رویم بفرما از این جناب کجا<br><br>مبین به سیب زنخدان که چاه در راه است<br><br>کجا همی‌روی ای دل بدین شتاب کجا<br><br>بشد که یاد خوشش باد روزگار وصال<br><br>خود آن کرشمه کجا رفت و آن عتاب کجا<br><br>قرار و خواب ز حافظ طمع مدار ای دوست<br><br>قرار چیست صبوری کدام و خواب کجا")'); 

tx.executeSql('INSERT INTO book72 ( poem) VALUES  ("اگر آن ترک شیرازی به دست آرد دل ما را<br><br>به خال هندویش بخشم سمرقند و بخارا را<br><br>بده ساقی می باقی که در جنت نخواهی یافت<br><br>کنار آب رکن آباد و گلگشت مصلا را<br><br>فغان کاین لولیان شوخ شیرین کار شهرآشوب<br><br>چنان بردند صبر از دل که ترکان خوان یغما را<br><br>ز عشق ناتمام ما جمال یار مستغنی است<br><br>به آب و رنگ و خال و خط چه حاجت روی زیبا را<br><br>من از آن حسن روزافزون که یوسف داشت دانستم<br><br>که عشق از پرده عصمت برون آرد زلیخا را<br><br>اگر دشنام فرمایی و گر نفرین دعا گویم<br><br>جواب تلخ می‌زیبد لب لعل شکرخا را<br><br>نصیحت گوش کن جانا که از جان دوست‌تر دارند<br><br>جوانان سعادتمند پند پیر دانا را<br><br>حدیث از مطرب و می گو و راز دهر کمتر جو<br><br>که کس نگشود و نگشاید به حکمت این معما را<br><br>غزل گفتی و در سفتی بیا و خوش بخوان حافظ<br><br>که بر نظم تو افشاند فلک عقد ثریا را")'); 
tx.executeSql('INSERT INTO book72 ( poem) VALUES ("صبا به لطف بگو آن غزال رعنا را<br><br>که سر به کوه و بیابان تو داده‌ای ما را<br><br>شکرفروش که عمرش دراز باد چرا<br><br>تفقدی نکند طوطی شکرخا را<br><br>غرور حسنت اجازت مگر نداد ای گل<br><br>که پرسشی نکنی عندلیب شیدا را<br><br>به خلق و لطف توان کرد صید اهل نظر<br><br>به بند و دام نگیرند مرغ دانا را<br><br>ندانم از چه سبب رنگ آشنایی نیست<br><br>سهی قدان سیه چشم ماه سیما را<br><br>چو با حبیب نشینی و باده پیمایی<br><br>به یاد دار محبان بادپیما را<br><br>جز این قدر نتوان گفت در جمال تو عیب<br><br>که وضع مهر و وفا نیست روی زیبا را<br><br>در آسمان نه عجب گر به گفته حافظ<br><br>سرود زهره به رقص آورد مسیحا را")');

tx.executeSql('INSERT INTO book72 ( poem) VALUES ("دل می‌رود ز دستم صاحب دلان خدا را<br><br>دردا که راز پنهان خواهد شد آشکارا<br><br>کشتی شکستگانیم ای باد شرطه برخیز<br><br>باشد که بازبینم دیدار آشنا را<br><br>ده روزه مهر گردون افسانه است و افسون<br><br>نیکی به جای یاران فرصت شمار یارا<br><br>در حلقه گل و مل خوش خواند دوش بلبل<br><br>هات الصبوح هبوا یا ایها السکارا<br><br>ای صاحب کرامت شکرانه سلامت<br><br>روزی تفقدی کن درویش بی‌نوا را<br><br>آسایش دو گیتی تفسیر این دو حرف است<br><br>با دوستان مروت با دشمنان مدارا<br><br>در کوی نیک نامی ما را گذر ندادند<br><br>گر تو نمی‌پسندی تغییر کن قضا را<br><br>آن تلخ وش که صوفی ام الخبائثش خواند<br><br>اشهی لنا و احلی من قبله العذارا<br><br>هنگام تنگدستی در عیش کوش و مستی<br><br>کاین کیمیای هستی قارون کند گدا را<br><br>سرکش مشو که چون شمع از غیرتت بسوزد<br><br>دلبر که در کف او موم است سنگ خارا<br><br>آیینه سکندر جام می است بنگر<br><br>تا بر تو عرضه دارد احوال ملک دارا<br><br>خوبان (ترکان) پارسی گو بخشندگان عمرند<br><br>ساقی بده بشارت رندان پارسا را<br><br>حافظ به خود نپوشید این خرقه می آلود<br><br>ای شیخ پاکدامن معذور دار ما را")');


tx.executeSql('INSERT INTO book72 ( poem) VALUES ("به ملازمان سلطان که رساند این دعا را<br><br>که به شکر پادشاهی ز نظر مران گدا را<br><br>ز رقیب دیوسیرت به خدای خود پناهم<br><br>مگر آن شهاب ثاقب مددی دهد خدا را<br><br>مژه سیاهت ار کرد به خون ما اشارت<br><br>ز فریب او بیندیش و غلط مکن نگارا<br><br>دل عالمی بسوزی چو عذار برفروزی<br><br>تو از این چه سود داری که نمی‌کنی مدارا<br><br>همه شب در این امیدم که نسیم صبحگاهی<br><br>به پیام آشنایان بنوازد آشنا را<br><br>چه قیامت است جانا که به عاشقان نمودی<br><br>دل و جان فدای رویت بنما عذار ما را<br><br>به خدا که جرعه‌ای ده تو به حافظ سحرخیز<br><br>که دعای صبحگاهی اثری کند شما را")');

tx.executeSql('INSERT INTO book72 ( poem) VALUES ("صوفی بیا که آینه صافیست جام را<br><br>تا بنگری صفای می لعل فام را<br><br>راز درون پرده ز رندان مست پرس<br><br>کاین حال نیست زاهد عالی مقام را<br><br>عنقا شکار کس نشود دام بازچین<br><br>کان جا همیشه باد به دست است دام را<br><br>در بزم دور یک دو قدح درکش و برو<br><br>یعنی طمع مدار وصال دوام را<br><br>ای دل شباب رفت و نچیدی گلی ز عیش<br><br>پیرانه سر مکن هنری ننگ و نام را<br><br>در عیش نقد کوش که چون آبخور نماند<br><br>آدم بهشت روضه دارالسلام را<br><br>ما را بر آستان تو بس حق خدمت است<br><br>ای خواجه بازبین به ترحم غلام را<br><br>حافظ مرید جام می است ای صبا برو<br><br>وز بنده بندگی برسان شیخ جام را")');
tx.executeSql('INSERT INTO book72 ( poem) VALUES ("ساقیا برخیز و درده جام را<br><br>خاک بر سر کن غم ایام را<br><br>ساغر می بر کفم نه تا ز بر<br><br>برکشم این دلق ازرق فام را<br><br>گر چه بدنامیست نزد عاقلان<br><br>ما نمی‌خواهیم ننگ و نام را<br><br>باده درده چند از این باد غرور<br><br>خاک بر سر نفس نافرجام را<br><br>دود آه سینهٔ نالان من<br><br>سوخت این افسردگان خام را<br><br>محرم راز دل شیدای خود<br><br>کس نمی‌بینم ز خاص و عام را<br><br>با دلارامی مرا خاطر خوش است<br><br>کز دلم یک باره برد آرام را<br><br>ننگرد دیگر به سرو اندر چمن<br><br>هر که دید آن سرو سیم اندام را<br><br>صبر کن حافظ به سختی روز و شب<br><br>عاقبت روزی بیابی کام را")');
tx.executeSql('INSERT INTO book72 ( poem) VALUES ("رونق عهد شباب است دگر بستان را<br><br>می‌رسد مژده گل بلبل خوش الحان را<br><br>ای صبا گر به جوانان چمن بازرسی<br><br>خدمت ما برسان سرو و گل و ریحان را<br><br>گر چنین جلوه کند مغبچه باده فروش<br><br>خاکروب در میخانه کنم مژگان را<br><br>ای که بر مه کشی از عنبر سارا چوگان<br><br>مضطرب حال مگردان من سرگردان را<br><br>ترسم این قوم که بر دردکشان می‌خندند<br><br>در سر کار خرابات کنند ایمان را<br><br>یار مردان خدا باش که در کشتی نوح<br><br>هست خاکی که به آبی نخرد طوفان را<br><br>برو از خانه گردون به در و نان مطلب<br><br>کان سیه کاسه در آخر بکشد مهمان را<br><br>هر که را خوابگه آخر مشتی خاک است<br><br>گو چه حاجت که به افلاک کشی ایوان را<br><br>ماه کنعانی من مسند مصر آن تو شد<br><br>وقت آن است که بدرود کنی زندان را<br><br>حافظا می خور و رندی کن و خوش باش ولی<br><br>دام تزویر مکن چون دگران قرآن را")');
tx.executeSql('INSERT INTO book72 ( poem) VALUES ("دوش از مسجد سوی میخانه آمد پیر ما<br><br>چیست یاران طریقت بعد از این تدبیر ما<br><br>ما مریدان روی سوی قبله چون آریم چون<br><br>روی سوی خانه خمار دارد پیر ما<br><br>در خرابات طریقت ما به هم منزل شویم<br><br>کاین چنین رفته‌ست در عهد ازل تقدیر ما<br><br>عقل اگر داند که دل در بند زلفش چون خوش است<br><br>عاقلان دیوانه گردند از پی زنجیر ما<br><br>روی خوبت آیتی از لطف بر ما کشف کرد<br><br>زان زمان جز لطف و خوبی نیست در تفسیر ما<br><br>با دل سنگینت آیا هیچ درگیرد شبی<br><br>آه آتشناک و سوز سینه شبگیر ما<br><br>تیر آه ما ز گردون بگذرد حافظ خموش<br><br>رحم کن بر جان خود پرهیز کن از تیر ما")');

//tx.executeSql('INSERT INTO book72 ( poem) VALUES ("")');
});  




function getfall(){

var uu = Math.floor((Math.random() * 10) );
alert(uu);
db_mori_hafez.transaction(function (tx) { 

    tx.executeSql('SELECT * FROM book72', [], function (tx, results) {
              document.getElementById("fall").innerHTML =results.rows.item(uu).poem;
                                  }  
                                                                                 , null);  
                             });  
                            }

function startt() {
  var output = document.form1.moritextarea.value;
  output = output.replace(/(?:\r\n|\r|\n)/g, '<br>');
  alert(output);
  }
